Revit 2027 API
ElectricalDemandFactorValue Constructor
Overload List
Name | Description
ElectricalDemandFactorValue() |  Default constructor. Initializes factor to 1.0 or 100%. Min and max range are set to 0.0
ElectricalDemandFactorValue(Double, Double, Double) |  Constructor. Initializes factor, minimum range and maximum range to values passed in.
Top
See Also
Reference
ElectricalDemandFactorValue Class
Autodesk.Revit.DB.Electrical Namespace